

#ifndef __PLAT_EFUSE_H__
#define __PLAT_EFUSE_H__

#ifdef __cplusplus
#if __cplusplus
extern "C" {
#endif
#endif


/*****************************************************************************
  1 其他头文件包含
*****************************************************************************/

#include <linux/moduleparam.h>
#include <linux/delay.h>
#include <linux/rtc.h>
#include "plat_debug.h"
#include "plat_firmware.h"

/*****************************************************************************
  2 宏定义
*****************************************************************************/
#define GET_EFUSE_CMD          "0x50000744,64"
#define GET_EFUSE_EC_VERSION   "0x50000770,4"
#ifndef HISI_WIFI_MISC_TOP_DIR
#define EFUSE_FILE_PATH        "/data/misc/wifi/efuse"
#else
#define EFUSE_FILE_PATH        HISI_WIFI_MISC_TOP_DIR"/wifi/efuse"
#endif
#define EFUSE_REG_NUM          (16)
#define EFUSE_VALUE_WIDTH      (16)
#define EFUSE_REG_WIDTH        (4)
#define EFUSE_REG_ADDR_BASE    (0x50000744)
#define EFUSE_BUFF_LEN         (128)
#define EFUSE_RETRY            (3)
#define DIEID_BIT_4            (4)
#define DIEID_BIT_21           (21)
#define DIEID_BIT_45           (45)
#define DIEID_BIT_53           (53)
#define DIEID_BIT_79           (79)
#define DIEID_BIT_95           (95)

/*1103,38.4M 共时钟请求控制*/
#define STR_REG_PMU_CLK_REQ    ("0x50000350")

/*ec version define*/
#define V100                   (0x00)
#define V120                   (0x01)

#define STR_REG_NFC_EN_KEEP    ("0x60001044")

/*****************************************************************************
  3 枚举定义
*****************************************************************************/


/*****************************************************************************
  4 全局变量声明
*****************************************************************************/


/*****************************************************************************
  5 消息头定义
*****************************************************************************/


/*****************************************************************************
  6 消息定义
*****************************************************************************/


/*****************************************************************************
  7 STRUCT定义
*****************************************************************************/


/*****************************************************************************
  8 UNION定义
*****************************************************************************/


/*****************************************************************************
  9 OTHERS定义
*****************************************************************************/


/*****************************************************************************
  10 函数声明
*****************************************************************************/
extern int32 number_type_cmd_send_etc(uint8 *Key, uint8 *Value);
extern int32 read_msg_etc(uint8 *data, int32 len);
extern void  store_efuse_info_etc(void);
extern uint8 get_ec_version_etc(void);

#ifdef __cplusplus
    #if __cplusplus
        }
    #endif
#endif

#endif /* end of plat_efuse.h */
